wordpress/wordpress_bug.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>wordpress<sub>bug</sub></title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-10-30 14:50:44 CST"/>
<meta name="author" content="CrimsonFantasy"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">wordpress<sub>bug</sub></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Could not create directory </a>
<ul>
<li><a href="#sec-1.1">1.1 slove </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Could not create directory </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
 when
<ul>
<li>
installing plugin 
</li>
</ul>
</li>
</ul>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> slove </h3>
<div class="outline-text-3" id="text-1.1">

<p>First do not use 777, change it back to 755.
Second you need to add the proper group permissions most likely to the same that Apache is running under. To find that out try:
</p>


<pre class="example">ps aux | grep apache 
</pre>



<p>
You will see the Apache user group on the left.
Now change your WordPress folder to the same user group, you can do this in a parent folder or sub folder but for sanity it usually best for parent folder, use -R to recursively do it.
</p>


<pre class="example">chown -R www-data:www-data /path/to/wp-root-folder
</pre>




</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: CrimsonFantasy
<a href="mailto:crimsonfantasy@CrimsonFantasy.www.crimsonfantasy.com">&lt;crimsonfantasy@CrimsonFantasy.www.crimsonfantasy.com&gt;</a>
</p>
<p class="date"> Date: 2014-10-30 14:50:44 CST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
